app/controllers/camps_controller.rb

  def index
    @camps = Camp.all.paginate(page: params[:camps]).per_page(5)
---
SELECT "camps".* FROM "camps"

  def set_camp
    @camp = Camp.find(params[:id])
---
SELECT  "camps".* FROM "camps" WHERE "camps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]