app/controllers/camp_counselors_controller.rb

SELECT "camp_counselors".* FROM "camp_counselors" WHERE "camp_counselors"."camp_id" = $1  [["camp_id", 4]]
---
  def index
    @camp_counselors = CampCounselor.where(camp_id: params[:camp_id]).paginate(page: params[:camp_counselors]).per_page(10)

SELECT  "camp_counselors".* FROM "camp_counselors" WHERE "camp_counselors"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "counselors".* FROM "counselors" WHERE "counselors"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def set_camp_counselor
    @camp_counselor = CampCounselor.find(params[:id])