app/controllers/camp_badges_controller.rb

  def index
    @camp_badges = CampBadge.all.alphabetical.paginate(page: params[:camp_badges]).per_page(10)
---
SELECT "camp_badges".* FROM "camp_badges"

  def show
    @camp = @camp_badge.camp
    @badge = @camp_badge.badge
    @tasks = @badge.tasks
    @ccbs = @camp_badge.camper_camp_badges.paginate(page: params[:ccbs]).per_page(10)
---
SELECT  "counselor_camp_badges".* FROM "counselor_camp_badges" WHERE "counselor_camp_badges"."camp_badge_id" = $1 LIMIT $2  [["camp_badge_id", 1], ["LIMIT", 11]]

  def set_camp_badge
    @camp_badge = CampBadge.find(params[:id])
---
SELECT  "camp_badges".* FROM "camp_badges" WHERE "camp_badges"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "counselor_camp_badges".* FROM "counselor_camp_badges" WHERE "counselor_camp_badges"."camp_badge_id" = $1 ORDER BY "counselor_camp_badges"."id" ASC LIMIT $2  [["camp_badge_id", 1], ["LIMIT", 1]]