app/controllers/campers_controller.rb

SELECT  "campers".* FROM "campers" WHERE "campers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def set_camper
    @camper = Camper.find(params[:id])