app/controllers/camper_registrations_controller.rb

  def index
    @camper_registrations = CamperRegistration.where(camp_id: params[:camp_id]).paginate(page: params[:camper_registrations]).per_page(10)
    @camp = Camp.find(params[:camp_id])
---
SELECT "camper_registrations".* FROM "camper_registrations" WHERE "camper_registrations"."camp_id" = $1  [["camp_id", 4]]
SELECT  "camps".* FROM "camps" WHERE "camps"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]