app/controllers/counselors_controller.rb

SELECT "camps".* FROM "camps" INNER JOIN "camp_badges" ON "camps"."id" = "camp_badges"."camp_id" INNER JOIN "counselor_camp_badges" ON "camp_badges"."id" = "counselor_camp_badges"."camp_badge_id" WHERE "counselor_camp_badges"."counselor_id" = $1 AND (start_date <= '2019-04-15' and end_date >= '2019-04-15') ORDER BY start_date, end_date  [["counselor_id", 2]]
---
  def show
    @camps = @counselor.camps.paginate(:page => params[:camps]).per_page(10)

SELECT  "counselors".* FROM "counselors" WHERE "counselors"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def set_counselor
    @counselor = Counselor.find(params[:id])