app/controllers/home_controller.rb

SELECT "camps".* FROM "camps" WHERE (start_date <= '2019-04-08' and end_date >= '2019-04-08') ORDER BY name
SELECT  "camps".* FROM "camps" WHERE (start_date <= '2019-04-08' and end_date >= '2019-04-08') ORDER BY name LIMIT ?  [["LIMIT", 11]]
SELECT  1 AS one FROM "camps" WHERE (start_date <= '2019-04-08' and end_date >= '2019-04-08') LIMIT ?  [["LIMIT", 1]]
---
  def index
    if logged_in? && current_user.role?(:admin)
      @current_camps = Camp.all.current.alphabetical.paginate(page: params[:current_camps]).per_page(5)
    elsif logged_in? && current_user.role?(:parent)
      @parent = Parent.where(user_id: current_user).first
      @campers = @parent.campers
    elsif logged_in? && current_user.role?(:counselor)
      @counselor = Counselor.where(user_id: current_user).first
      @current_camp = @counselor.camps.current.first
      unless @counselor.camp_badges.empty?