app/controllers/users_controller.rb

UPDATE "users" SET "first_name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Kimberly1"], ["password_digest", "$2a$10$ed1ON0S0ZfJt3yDCQv5Wwuhh8MOHgGERT91iAW6Lm9V83lZOOMhti"], ["updated_at", "2019-04-08 22:19:15.592075"], ["id", 1]]
---
  def update
    if @user.update_attributes(user_params)