YCHAT/app/controllers/camps_controller.rb

SELECT "camps".* FROM "camps"
---
  def index
    @camps = Camp.all