YCHAT/app/controllers/users_controller.rb

  def show
    @users = User.all.paginate(page: params[:users]).per_page(10)
---
SELECT  "users".* FROM "users" LIMIT ?  [["LIMIT", 11]]

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "first_name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?